<script setup>
import CardSeasones from "../components/CardSeasones.vue"
import {onMounted,ref} from "vue";
let cards = ref([
    {
        img:"https://upload.wikimedia.org/wikipedia/ru/thumb/f/f6/The_Boys_Season_1.jpg/960px-The_Boys_Season_1.jpg",
        title:"1 сезон",
        desc:"знакомит с миром, где супергерои злоупотребляют своей силой. Отряд линчевателей во главе с Билли Бутчером объявляет войну корпорации Vought и элитной команде «Семерка», чтобы раскрыть их преступления и гибель возлюбленной Хьюи Кэмпбелла",
    },
    {
        img:"https://upload.wikimedia.org/wikipedia/ru/thumb/1/14/The_Boys_Season_2.jpg/960px-The_Boys_Season_2.jpg",
        title:"2 сезон",
        desc:"В центре сюжета — противостояние отряда изгоев во главе с Бутчером корпорации Vought. Конфликт обостряется, когда выясняется, что жена Бутчера жива и воспитывает сына-супера от Хоумлендера.",        
    },    {
        img:"https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRxxyusk-Dw-nG-5EfSxC1_DiXsW7QEw7Y2rw&s",
        title:"3 сезон",
        desc:"События разворачиваются спустя год после финала второго сезона. Бутчер и его команда работают на правительство под началом Виктории Ньюман, контролируя супергероев. Всё меняется, когда «Пацаны» узнают о существовании Солдатика — легендарного супергероя времен Холодной войны, способного лишать других их сил. Чтобы победить обезумевшего Хоумлендера, Бутчер идет на отчаянный шаг и принимает экспериментальный препарат, дающий суперспособности на 24 часа.",        
    },    {
        img:"https://upload.wikimedia.org/wikipedia/ru/c/cc/The_Boys_Season_4.jpg",
        title:"4 сезон",
        desc:"Действие происходит шесть месяцев спустя после событий предыдущего сезона: Виктория Ньюман (Думит) как никогда близка к вступлению в должность президента Соединённых Штатов, одновременно с этим находясь под контролем Хоумлендера (Старр), который всё сильнее и сильнее наращивает свою власть над страной. Билли Бутчеру (Урбан) осталось жить всего несколько месяцев, и если он хочет спасти мир, пока не стало слишком поздно, то должен найти способ наладить сотрудничество с «Пацанами», которым надоела его ложь.",        
    },    {
        img:"https://upload.wikimedia.org/wikipedia/en/9/9b/The_Boys_Season_5.jpg",
        title:"5 сезон",
        desc:"не завершён",        
    },
]);

</script>


<template>
    <section>
        <CardSeasones v-for="(card, i) in cards" :key="i" :card="card"/>
    </section>
</template>

<style scoped>
section {
    display:grid;
    gap: 40px;
}
</style>