<template>
    <div>
        <img src="https://upload.wikimedia.org/wikipedia/ru/thumb/f/f6/The_Boys_Season_1.jpg/960px-The_Boys_Season_1.jpg">
        <nav>
            <h2>1 сезон</h2>
            <p>
                Хьюи Кэмпбелл становится свидетелем того, как его подругу Робин убивает знаменитый супергерой Поезд-А, якобы преследовавший грабителей. Юристы Поезда-А предлагают Хьюи 45 000 долларов в качестве компенсации за молчание, однако он не намерен принимать это предложение. Энни Дженьюэри проходит прослушивание на роль Старлайт и занимает место в «Семёрке» супергероев, освободившееся после ухода Фонарщика. Во время посещения штаб-квартиры Vought Энни знакомится со своим любимым персонажем Глубиной, который шантажирует девушку и склоняет к оральному сексу[2]. Билли Бутчер обращается к Хьюи с просьбой раздобыть компромат на супергероев и приводит в тайный клуб «Supes», где показывает Хьюи видеозапись, на которой Поезд-А насмехается над смертью Робин. Бутчер, не обнаруживший никаких доказательств подвигов Поезда-А в тот день, поручает Хьюи разместить жучок в штаб-квартире Vought, но Хьюи отказывается. В парке Энни знакомится с Хьюи, и они мотивируют друг друга стоять за себя и решать проблемы. Хьюи берётся за поручение Бутчера и устанавливает подслушивающее устройство. Один из «Семёрки», Прозрачный, обнаруживает жучок и нападает на Хьюи в магазине, но Бутчер прибывает вовремя, чтобы спасти его, и они вместе вырубают Прозрачного. Тем временем, Патриот сбивает самолёт мэра Балтимора, который пытался шантажировать компанию Vought из-за использования препарата V.
            </p>
        </nav>
    </div>
</template>